
(function(root,factory){
    if(typeof define ==='function' && define.amd){
        define(['numberToWords'],function(numberToWords){
            numberToWords.setLocal('ru',factory())
        })
    }else{
        numberToWords.setLocal('ru',factory())
    }
}(this,function(){
    return {
        arrayOfString1 : ["", "сто ", "двести ", "триста ", "четыреста ", "пятьсот ", "шестьсот ", "семьсот ", "восемьсот ", "девятьсот "],
        arrayOfString2 : ["", "один ", "два ", "три ", "четыре ", "пять ", "шесть ", "семь ", "восемь ", "девять "],
        arrayOfString3 : ["десять ", "одиннадцать ", "двенадцать ", "тринадцать ", "четырнадцать ", "пятнадцать ", "шестнадцать ", "семнадцать ", "восемнадцать ", "девятнадцать "],
        arrayOfString4 : ["", "", "двадцать ", "тридцать ", "сорок ", "пятьдесят ", "шестьдесят ", "семьдесят ", "восемьдесят ", "девяносто "],
        arrayOfString5 : ["тысяча ","тысячи ","тысяч" ],
        arrayOfString6 : ["", "одна ", "две ","три ", "четыре ", "пять ", "шесть ", "семь ", "восемь ", "девять "],
        arrayOfString7 : ["миллион ","миллиона ","миллионов" ]
    }
}));
