(function (root, factory) {
    if (typeof define === 'function' && define.amd) {
        define(['numberToWords'], function (numberToWords) {
            numberToWords.setLocal('ua', factory())
        })
    } else {
        numberToWords.setLocal('ua', factory())
    }
}(this, function () {
    return {
        arrayOfString1: ["", "сто ", "двiстi ", "триста ", "чотириста ", "п'ятьсот ", "шiстьсот ", "сiмсот ", "вiсiмсот ", "дев'ятьсот "],
        arrayOfString2: ["", "один ", "два ", "три ", "чотири ", "п'ять ", "шiсть ", "сiм ", "вiсiм ", "дев'ять "],
        arrayOfString2_1: ["", "першого ", "другого ", "третього ", "четвертого ", "п'ятого ", "шостого ", "сьомого ", "восьмого ", "дев'ятого "],
        arrayOfString2_2: ["", "одна ", "двi ", "три ", "чотири ", "п'ять ", "шiсть ", "сiм ", "вiсiм ", "дев'ять "],
        arrayOfString3: ["десять ", "одинадцять ", "дванадцять ", "тринадцять ", "чотирнадцять ", "п'ятнадцять ", "шiстнадцять ", "сiмнадцять ", "вiсiмнадцять ", "дев'ятнадцять "],
        arrayOfString3_1: ["десятого ", "одинадцятого ", "дванадцятого ", "тринадцятого ", "чотирнадцятого ", "п'ятнадцятого ", "шістнадцятого ", "сімнадцятого ", "вісімнадцятого ", "дев'ятнадцятого "],
        arrayOfString4: ["", "", "двадцять ", "тридцять ", "сорок ", "п'ятдесят ", "шiстдесят", "сiмдесят ", "вiсiмдесят ", "дев'яносто "],
        arrayOfString4_1: ["", "", "двадцятого ", "тридцятого ", "сорокового ", "п'ятдесятого ", "шестидесятого ", "семидесятого ", "вісімдесятого ", "дев'яностого "],
        arrayOfString5: ["тисяча ", "тисячі ", "тисяч"],
        arrayOfString6: ["", "одна ", "двi ", "три ", "чотири ", "п'ять ", "шiсть ", "сiм ", "вiсiм ", "дев'ять "],
        arrayOfString7: ["мільйон ", "мільйона ", "мільйонів "],
        arrayOfString8: ["ноль "],
        currency: {
            "UAH": ["гривня ", "гривні ", "гривень "],
            "USD": ["долар ", "долара ", "доларів "],
            "EUR": ["євро ", "євро ", "євро "]
        },
        currency2: {
            "UAH": ["копійка ", "копійки ", "копійок "],
            "USD": ["цент ", "цента ", "центів "],
            "EUR": ["євроцент ", "євроцента ", "євроцентів "]
        },
        years: ["рік ", "року ", "років "],
        days: [
            [
                "перше ",
                "друге ",
                "третє ",
                "четверте ",
                "п'яте ",
                "шосте ",
                "сьоме ",
                "восьме ",
                "дев'яте ",
                "десяте ",
                "одинадцяте ",
                "дванадцяте ",
                "тринадцяте ",
                "чотирнадцяте ",
                "п'ятнадцяте ",
                "шістнадцяте ",
                "сімнадцяте ",
                "вісімнадцяте ",
                "дев'ятнадцяте ",
                "двадцяте ",
                "двадцять перше ",
                "двадцять друге ",
                "двадцять третє ",
                "двадцять четверте ",
                "двадцять п'яте ",
                "двадцять шосте ",
                "двадцять сьоме ",
                "двадцять восьме ",
                "двадцять дев'яте ",
                "тридцяте ",
                "тридцять перше "
            ],
            [
                "першого ",
                "другого ",
                "третього ",
                "четвертого ",
                "п'ятого ",
                "шостого ",
                "сьомого ",
                "восьмого ",
                "дев'ятого ",
                "десятого ",
                "одинадцятого ",
                "дванадцятого ",
                "тринадцятого ",
                "чотирнадцятого ",
                "п'ятнадцятого ",
                "шістнадцятого ",
                "сімнадцятого ",
                "вісімнадцятого ",
                "дев'ятнадцятого ",
                "двадцятого ",
                "двадцять першого ",
                "двадцять другого ",
                "двадцять третього ",
                "двадцять четвертого ",
                "двадцять п'ятого ",
                "двадцять шостого ",
                "двадцять сьомого ",
                "двадцять восьмого ",
                "двадцять дев'ятого ",
                "тридцятого ",
                "тридцять першого "
            ]
        ],
        month: [
            "січня ",
            "лютого ",
            "березня ",
            "квітня ",
            "травня ",
            "червня ",
            "липня ",
            "серпня ",
            "вересня ",
            "жовтня ",
            "листопада ",
            "грудня "
        ]
    }
}));
